[
    {
        "role":"Lead Data Scientist",
        "company":"MTI Technology",
        "summary":" ● Lead data strategy to identify and analyze new datasets, develop signal processing algorithms, fueling the development of machine learning models and build AI-based systems to enhance MTI's weather services (e.g., Hail forecast system) and automate labour-intensive processes like Japanese article arrangement, Typesetting (patented in Japan) and AI-enhanced verbal medical record systems.<br /> ● Collaborate with software developers and data scientists to deploy predictive models into production environments and construct system testing. <br> ● Design and implement algorithms to mine large-scale datasets, conducting error analysis and data cleaning to support market analysis (e.g., Market Insights). <br> ● Coordinate with stakeholders to translate business objectives into actionable data science tasks, perform project planning and communicate findings and recommendations. <br> ● Mentor and guide junior data scientists, fostering their professional growth and ensuring the high quality and consistency of their work.",
        "range":"March 2020 - Present"
    },
    {
        "role":"Data Scientist / Machine Learning Engineer Freelancer",
        "summary":"I worked with multiple clients from Australia and Singapore, undertaking research and development projects centered on AI-driven solutions for streamlining administrative HR processes. This encompassed the creation of tools for tasks such as Resume Screening and Open-Domain Question Answer Systems. Furthermore, I contributed to a project focusing on employing Generative models for time series forecasting, showcasing versatility across a range of advanced AI techniques and applications.",
        "range":"September 2019 - Present"
    },
    {
        "role":"Research Assistant",
        "company":"Royal Melbourne Institute of Technology",
        "summary":"● Collecting and analyzing data <br>  ● Conducting literature reviews <br> ● Assisting with project development <br> ● Preparing research documents <br> ● Assisting with administration",
        "range":"May 2019 - November 2019"
    }
]